package org.example._2024_03_07.HomeWork;
//Создайте класс Concatenation
//Создайте две переменные типа String
//Примените конкатенацию строк и выведите результат в консоль.
//Скомпилируйте созданную программу.
//Запустите программу в терминале.
public class Concatenation {
    public static void main(String[] args) {
        String country = "Germany";
        String capital = "Berlin";
        System.out.println(country+capital);
    }
}
